{
  "basics": {
    "name": "Yoseph Berhanu",
    "label": "Graduate Student",
    "image": "",
    "email": "contact@yoseph.et",
    "url": "https://yoseph.et",
    "summary": "Graduate student and researcher with over 10 years of software engineering experience, specializing in AI-powered tools to enhance software development efficiency. Proficient in Software Development, Deep Learning, and data-driven solutions, with a proven track record of designing impactful systems and leading innovative research initiatives. Passionate about bridging technology and user needs to drive productivity and innovation.s",
    "location": {
      "postalCode": "VA 24060",
      "city": "Blacksburg",
      "countryCode": "US",
      "region": "Virginia"
    },
    "profiles": [
      {
        "network": "X",
        "username": "yosephberhanu",
        "url": "https://x.com/yosephberhanu"
      }
    ]
  },
  "work": [
    {
      "name": "Department of Computer Science, Virginia Tech",
      "position": "Graduate Assistant",
      "url": "https://vt.edu",
      "startDate": "2023-08-20",
      "endDate": "date",
      "summary": "Conducting research on cognitive support systems to enhance software developer practices at the code world no blanket lab",
      "highlights": [
        "Designed and currently developing an AI-powered visualization tool to enhance large program comprehension, aiming to improve developer efficiency and reduce cognitive load.",
        "Conducted a mixed-method study to understand perspectives, expectations, and challenges in the source code review process related to bias, leading to actionable insights, such as onboarding challenges and documentation limitations.",
        "Provided hands-on support for assignments and projects in Machine Learning, Cloud Software Development, and Algorithm courses, contributing to enhanced student understanding and improved project outcomes.",
        "Instructor of record for a course on Analysis and Design of Algorithms"
      ]
    },
    {
      "name": "World Bank Group, Addis Ababa, Ethiopia",
      "position": "LIS Expert",
      "url": "https://www.worldbank.org",
      "startDate": "2022-03-01",
      "endDate": "2023-06-30",
      "highlights": [
        "Conducted assessments of six Ethiopian land information systems for the Integrated Land Management Project (ILMP), providing the basis for high-level requirements, architecture, and strategic recommendations to enhance governmental land management capabilities.",
        "Developed high-level requirements and outlined investments for a national land management system, leveraging assessment insights to deliver situation analyses, design recommendations, and cost-benefit analyses, ensuring seamless interoperability, streamlined data management, and informed decision-making."
      ]
    },
    {
      "name": "NIRAS International Consulting, Addis Ababa, Ethiopia",
      "position": "Information Technology Expert",
      "url": "https://www.niras.com",
      "startDate": "2021-06-01",
      "endDate": "2022-09-10",
      "highlights": [
        "Developed and maintained components for the National Rural Land Information System (NRLAIS) for the Ministry of Agriculture, Ethiopia, using Java EE and Python (QGIS plugin), enabling efficient land management and streamlined geospatial data processing.",
        "Advised on strategic decisions for the national roll-out of NRLAIS, addressing incremental functionality additions, regional expansion challenges, and diverse regional rules , leading to an open-source-based implementation that saved the project an estimated $10M over 10 years in license costs ."
      ]
    },
    {
      "name": "Digital Medarbeider AS, Norway (Remote), Ethiopia",
      "position": "Tech Lead",
      "url": "https://www.digitalmedarbeider.no",
      "startDate": "2019-12-01",
      "endDate": "2021-07-30",
      "highlights": [
        "Designed and developed 12 micro-service-based SaaS applications using .Net Core RESTful APIs and progressive Angular front-end apps, delivering scalable and efficient business solutions.",
        "Devised and implemented CI/CD strategies using GitLab and Azure DevOps, resulting in a 45% improvement in delivery time.",
        "Developed and standardized reusable libraries and packages, including authentication, authorization, and auditing services, enhancing code reusability and reducing development overhead.",
        "Designed and developed a suite of reusable libraries for authentication, authorization, auditing, communication, UI framework, and a common services library with semi-automatic localization and external API integration proxies , achieving a 28% improvement in project bootstrap speed.",
        "Mentored junior developers and led a team of 18 by fostering a collaborative environment, promoting peer learning and cooperative problem-solving that enhanced team performance and knowledge sharing.",
        "Introduced map-based services for cross-application use, including support for the Norwegian SOSI formats, enabling seamless geospatial data integration and migration."
      ]
    },
    {
      "name": "DAI, Addis Ababa, Ethiopia",
      "position": "Software Developer",
      "url": "https://www.dai.com",
      "startDate": "2014-11-01",
      "endDate": "2017-06-30",
      "highlights": [
        "Developed two systems for rural land administration, one of which became the foundation of the National Rural Land Administration System.",
        "Designed and developed a mass registration system (MASSREG) using Java EE, PostGIS, and Python-enhanced QGIS, certifying over 14 million landholders across 150 Woredas.",
        "Designed and developed a land transaction management system that supported over 20 land transactions with customizable rules for each, successfully deployed in all Woredas following MASSREG.",
        "Designed a custom Management Information System (MIS) with Laravel and MySQL, pioneering an incremental synchronization feature for offline data integrity across 150 deployment sites."
      ]
    },
    {
      "name": "Addis Ababa University, Addis Ababa, Ethiopia",
      "position": "Lecturer",
      "url": "https://www.aau.edu.et",
      "startDate": "2014-01-15",
      "endDate": "2023-07-15",
      "highlights": [
        "Delivered core computer science courses, including Introductory Programming, Data Structures, Theory of Algorithms, Advanced Unix Programming, and Object-Oriented Programming, providing students with a strong theoretical foundation and practical skills for advanced study and careers.",
        "Co-organized a community outreach program that introduced computer science concepts to over 500 high school students, supported by 15 volunteer undergraduates, fostering early interest and engagement in STEM fields.",
        "Led curriculum development and review efforts as a member of the Curriculum Review Committee, ensuring alignment with global computer science standards and promoting inclusivity for a diverse student body.",
        "Served on academic, community service guideline, and project management committees, contributing to the enhancement of departmental operations through improved collaboration and effective policy implementation.",
        "Co-founded and led 4K Labs in 2016, transforming it from a RoboCup participant to an undergraduate R&D lab specializing in AI, robotics, and IoT, creating hands-on learning and research opportunities for students.",
        "Coordinated internship programs, arranging over 250 summer internship opportunities for students, enabling them to gain practical experience and industry exposure to advance their careers."
      ]
    }
  ],
  "education": [
    {
      "institution": "Virginia Tech",
      "location": "Blacksburg, VA, USA",
      "url": "https://www.vt.edu/",
      "area": "Computer Science",
      "studyType": "PhD",
      "startDate": "2023-07-01",
      "endDate": "2027-04-30",
      "courses": [
        "<strong>Research Focus</strong>: Building AI powered tools for software developers in large software projects.",
        "<strong>Sample Coursework</strong>: Software Engineering;  Machine Learning; Deep Learing; Models, Theories and Frameworks of HCI; Research Methods in CS "

      ]
    },
    {
      "institution": "Addis Ababa University",
      "location": "Addis Ababa, Ethiopia",
      "url": "https://www.aau.edu.et",
      "area": "Computer Science",
      "studyType": "M.Sc.",
      "startDate": "2011-09-30",
      "endDate": "2014-06-15",
      "score": "3.96",
      "courses": [
        "<strong>Thesis</strong>: <a href='https://d1wqtxts1xzle7.cloudfront.net/34988437/Final-libre.pdf?1412386200=&response-content-disposition=inline%3B+filename%3DA_Framework_for_Multi_source_Prefetching.pdf&Expires=1734361051&Signature=g6wJKeRHhrvFAxm-jepk41LyX7gOE8pgWKCuUYL-3H3Tgs8SzWvGwk77qFWhDxhyY4iHVeYGCjjp4fgu13F-ThEBIdZytGeiAuXmB8glMorkmXN8p35npXpriiH23WQaRfRUAgjRHfO1k4FJA8NxhlcA4Lngewh17BOR4zZoJJOrd0kZY~EzDviR1245h5Z3M3bxVDxtXNpGlzUGQyf9PvE2DA1e9FEBvF9O6RFK8vj0ed3bbGt8IqxttHg5LYTykIVaFqhdEtg~rgs9xvWXPXDW8vsKIVXYMAKIqEPrB4q6D0kZNocqfJgYF6fOsOciEJhunfJaJja9yHuPoRgHbw__&Key-Pair-Id=APKAJLOHF5GGSLRBV4ZA'>A Framework for Multi-source Prefetching Through Adaptive Weight</a> &nbsp;<italic>Grade </italic> - Excellent",
        "My thesis work implemented a federated machine learning to improve prefetching performance"

      ]
    },
    {
      "institution": "Addis Ababa University",
      "location": "Addis Ababa, Ethiopia",
      "url": "https://www.aau.edu.et",
      "area": "Computer Science",
      "studyType": "B.Sc.",
      "startDate": "2007-09-15",
      "endDate": "2010-06-20",
      "score": "3.74",
      "courses": [
        "<strong>Capston Project</strong>: Student Information System - designed using Service Orianted Architecture and built with DotNet and MS SQL Server."

      ]
    }
  ],
  "certificates": [
    {
      "name": "Introduction to Machine Learning with TensorFlow",
      "date": "2022",
      "issuer": "Udacity Nano-Degree program",
      "url": "https://udacity.com",
      "icon": "fa-solid fa-certificate"
    },
    {
      "name": "Mobile Application Developer",
      "date": "2016",
      "issuer": "IBM",
      "url": "https://ibm.com",
      "icon": "fa-solid fa-mobile"
    },
    {
      "name": "Big Data Developer - Mastery Award",
      "date": "2016",
      "issuer": "IBM",
      "url": "https://ibm.com",
      "icon": "fa-solid fa-database"
    }
  ],
  "publications": [
    {
      "name": "'Automatic Bias Detection in Source Code Review', PPIG",
      "publisher": "Yoseph Berhanu Alebachew and Chris Brown",
      "releaseDate": "2024-09",
      "url": "https://ppig.org/files/2024-PPIG-35th-alebachew.pdf",
      "summary": "Bias is an inherent threat to human decision-making, including in decisions made during software development....."
    },
    {
      "name": "'Are We on the Same Page? Examining Developer Perception Alignment in Open Source Code Reviews', EASE",
      "publisher": "Yoseph Berhanu Alebachew and Minhyuk Ko and Chris Brown",
      "releaseDate": "2025-06",
      "url": "https://yoseph.et/assets/EASE2025.pdf",
      "summary": ""
    },
    {
      "name": "'Human and LLM-Based Resume Matching: An Observational Study', NAACL",
      "publisher": "Swanand Vaishampayan and Hunter Leary and Yoseph Berhanu Alebachew and Louis Hickman and Brent Stevenor and Fletcher Wimbush and Weston Beck and Chris Brown",
      "releaseDate": "2025-05",
      "url": "https://yoseph.et/assets/NAACL_2025.pdf",
      "summary": ""
    }
  ],
  "skills": [
    {
      "name": "Machine Learning",
      "level": "Master",
      "icon": "fa-solid fa-hashtag",
      "keywords": [
        "PyTorch",
        "Scikit-learn",
        "TensorFlow",
        "GAN",
        "VAE",
        "Reinforcment Learning",
        "CNN",
        "Adversarial Attacks on ANN",
        "Self-supervised Learning"
      ]
    },
    {
      "name": "Programming",
      "level": "Master",
      "icon": "fa-solid fa-hashtag",
      "keywords": [
        "Python",
        "Java",
        "JavaScript/TypeScript",
        "C#",
        "PHP",
        "Angular",
        "Spring Boot",
        "Java EE",
        ".NET Core",
        "PostgreSQL",
        "MySQL",
        "MongoDB"
      ]
    },
    {
      "name": "Research",
      "level": "Master",
      "icon": "fa-solid fa-hashtag",
      "keywords": [
        "Quantitative",
        "Qualitative Research",
        "Data Analysis"
        
      ]
    },
    {
      "name": "Tools and Platforms",
      "level": "Master",
      "icon": "fa-solid fa-hashtag",
      "keywords": [
        "GitLab CI/CD",
        "Docker",
        "Kubernetes",
        "AWS",
        "Azure",
        "Git",
        "Bitbucket",
        "Jira",
        "Confluence"
      ]
    },
    {
      "name": "Other",
      "level": "Master",
      "icon": "fa-solid fa-hashtag",
      "keywords": [
        "Microservices Architecture and SaaS",
        "Tech Leadership",
        "Software Project Management",
        "Map-based Service Development",
        "Localization",
        "API Integration"
      ]
    }
  ],
  "languages": [
    {
      "language": "Amharic",
      "fluency": "Native speaker",
      "icon": ""
    },
    {
      "language": "English",
      "fluency": "Fluent",
      "icon": ""
    }
  ],
  "awards": [
    {
      "date": "2017",
      "title": "Certificate of Appreciation",
      "awarder": "Department of Computer Science, Addis Ababa University",
      "summary": "Recognized for outstanding leadership in initiating and managing projects in AI and robotics, fostering innovation and collaboration among students."
    },
    {
      "date": "2017",
      "title": "First Place Winner, African RoboCup Soccer Competition",
      "awarder": "iCog Labs",
      "summary": "Led and mentored a team of six undergraduates in applying robotics research to real-world problem-solving, culminating in a first-place finish in a continent-wide competition."
    },{
      "date": "2014",
      "title": "Valedictorian",
      "awarder": "Addis Ababa University",
      "summary": "Graduated as valedictorian with great distinction during my MSc studies"
    },
    {
      "date": "2010",
      "title": "Valedictorian",
      "awarder": "Addis Ababa University",
      "summary": "Graduated as valedictorian with great distinction during my BSc studies "
    }
  ]
}